In [1]:
import seaborn as sns

In [2]:
df = sns.load_dataset('healthexp')
df.head(df_numeric = df.select_dtypes(include='number')
df_numeric.cov()

   Year        Country  Spending_USD  Life_Expectancy
0  1970        Germany       252.311             70.6
1  1970         France       192.143             72.2
2  1970  Great Britain       123.993             71.9
3  1970          Japan       150.437             72.0
4  1970            USA       326.961             70.9

In [14]:
#co-varience
numeric = df.select_dtypes(include="number")
numeric.cov()

                         Year  Spending_USD  Life_Expectancy
Year               201.098848  2.571883e+04        41.915454
Spending_USD     25718.827373  4.817761e+06      4166.800912
Life_Expectancy     41.915454  4.166801e+03        10.733902

In [18]:
# pearson co-relation coefficent
numeric = df.select_dtypes(include='number')
numeric.corr(method = 'pearson')

                     Year  Spending_USD  Life_Expectancy
Year             1.000000      0.826273         0.902175
Spending_USD     0.826273      1.000000         0.579430
Life_Expectancy  0.902175      0.579430         1.000000

In [20]:
# shift+tab for more information about that paricular method
numeric = df.select_dtypes(include='number')
numeric.corr(method = 'spearman')

                     Year  Spending_USD  Life_Expectancy
Year             1.000000      0.931598         0.896117
Spending_USD     0.931598      1.000000         0.747407
Life_Expectancy  0.896117      0.747407         1.000000